chipKIT32/chipKIT-core/pic32/boards.txt
# new items
cerebot_mx4ck.platform=pic32
cerebot_mx4ck.board=_BOARD_CEREBOT_MX4CK_
cerebot_mx4ck.board.define=
cerebot_mx4ck.ccflags=ffff
cerebot_mx4ck.ldscript=chipKIT-application-32MX460F512.ld
# end of new items

cerebot_mx4ck.upload.protocol=stk500v2
cerebot_mx4ck.upload.maximum_size=520192
cerebot_mx4ck.upload.speed=115200
cerebot_mx4ck.upload.tool=pic32prog

cerebot_mx4ck.bootloader.low_fuses=0xff
cerebot_mx4ck.bootloader.high_fuses=0xdd
cerebot_mx4ck.bootloader.extended_fuses=0x00
cerebot_mx4ck.bootloader.path=not-supported
cerebot_mx4ck.bootloader.file=not-supported
cerebot_mx4ck.bootloader.unlock_bits=0x3F
cerebot_mx4ck.bootloader.lock_bits=0x0F

cerebot_mx4ck.build.mcu=32MX460F512L
cerebot_mx4ck.build.f_cpu=80000000L
cerebot_mx4ck.build.core=pic32
cerebot_mx4ck.build.variant=Cerebot_MX4cK

############################################################
chipkit_pro_mx4.name=chipKIT Pro MX4
chipkit_pro_mx4.group=chipKIT

# new items
chipkit_pro_mx4.platform=pic32
chipkit_pro_mx4.board=_BOARD_CEREBOT_MX4CK_
chipkit_pro_mx4.board.define=
chipkit_pro_mx4.ccflags=ffff
chipkit_pro_mx4.ldscript=chipKIT-application-32MX460F512.ld
# end of new items

chipkit_pro_mx4.upload.protocol=stk500v2
chipkit_pro_mx4.upload.maximum_size=520192
chipkit_pro_mx4.upload.speed=115200
chipkit_pro_mx4.upload.tool=pic32prog


chipkit_pro_mx4.bootloader.low_fuses=0xff
chipkit_pro_mx4.bootloader.high_fuses=0xdd
chipkit_pro_mx4.bootloader.extended_fuses=0x00
chipkit_pro_mx4.bootloader.path=not-supported
chipkit_pro_mx4.bootloader.file=not-supported
chipkit_pro_mx4.bootloader.unlock_bits=0x3F
chipkit_pro_mx4.bootloader.lock_bits=0x0F

chipkit_pro_mx4.build.mcu=32MX460F512L
chipkit_pro_mx4.build.f_cpu=80000000L
chipkit_pro_mx4.build.core=pic32
chipkit_pro_mx4.build.variant=Cerebot_MX4cK

############################################################
############################################################
cerebot_mx7ck.name=Cerebot MX7cK
cerebot_mx7ck.group=Cerebot

# new items
cerebot_mx7ck.platform=pic32
cerebot_mx7ck.board=_BOARD_CEREBOT_MX7CK_
cerebot_mx7ck.board.define=
cerebot_mx7ck.ccflags=ffff
cerebot_mx7ck.ldscript=chipKIT-application-32MX795F512.ld
# end of new items

cerebot_mx7ck.upload.protocol=stk500v2
cerebot_mx7ck.upload.maximum_size=520192
cerebot_mx7ck.upload.speed=115200
cerebot_mx7ck.upload.tool=pic32prog


cerebot_mx7ck.bootloader.low_fuses=0xff
cerebot_mx7ck.bootloader.high_fuses=0xdd
cerebot_mx7ck.bootloader.extended_fuses=0x00
cerebot_mx7ck.bootloader.path=not-supported
cerebot_mx7ck.bootloader.file=not-supported
cerebot_mx7ck.bootloader.unlock_bits=0x3F
cerebot_mx7ck.bootloader.lock_bits=0x0F

cerebot_mx7ck.build.mcu=32MX795F512L
cerebot_mx7ck.build.f_cpu=80000000L
cerebot_mx7ck.build.core=pic32
cerebot_mx7ck.build.variant=Cerebot_MX7cK

############################################################
chipkit_pro_mx7.name=chipKIT Pro MX7
chipkit_pro_mx7.group=chipKIT

# new items
chipkit_pro_mx7.platform=pic32
chipkit_pro_mx7.board=_BOARD_CEREBOT_MX7CK_
chipkit_pro_mx7.board.define=
chipkit_pro_mx7.ccflags=ffff
chipkit_pro_mx7.ldscript=chipKIT-application-32MX795F512.ld
# end of new items

chipkit_pro_mx7.upload.protocol=stk500v2
chipkit_pro_mx7.upload.maximum_size=520192
chipkit_pro_mx7.upload.speed=115200
chipkit_pro_mx7.upload.tool=pic32prog


chipkit_pro_mx7.bootloader.low_fuses=0xff
chipkit_pro_mx7.bootloader.high_fuses=0xdd
chipkit_pro_mx7.bootloader.extended_fuses=0x00
chipkit_pro_mx7.bootloader.path=not-supported
chipkit_pro_mx7.bootloader.file=not-supported
chipkit_pro_mx7.bootloader.unlock_bits=0x3F
chipkit_pro_mx7.bootloader.lock_bits=0x0F

chipkit_pro_mx7.build.mcu=32MX795F512L
chipkit_pro_mx7.build.f_cpu=80000000L
chipkit_pro_mx7.build.core=pic32
chipkit_pro_mx7.build.variant=Cerebot_MX7cK

############################################################
############################################################
chipkit_Pi.name=chipKIT Pi
chipkit_Pi.group=chipKIT

# new items
chipkit_Pi.platform=pic32
chipkit_Pi.board=_BOARD_CHIPKIT_PI_
chipkit_Pi.ccflags=-Map="map.map"
chipkit_Pi.board.define=
chipkit_Pi.ldscript=chipKIT-application-32MX250F128.ld
# end of new items

# Use a high -Gnum for devices that have less than 64K of data memory
# For -G1024, objects 1024 bytes or smaller will be accessed by
# gp-relative addressing
chipkit_Pi.compiler.c.flags=-O2 -c -mno-smart-io -w -ffunction-sections -fdata-sections -G1024 -g -mdebugger -Wcast-align -fno-short-double
chipkit_Pi.compiler.cpp.flags=-O2 -c -mno-smart-io -w -fno-exceptions -ffunction-sections -fdata-sections -G1024 -g -mdebugger -Wcast-align -fno-short-double

chipkit_Pi.upload.protocol=stk500v2
# 128KB - 4K for EEPROM - 4K for bootloader
chipkit_Pi.upload.maximum_size=122880
chipkit_Pi.upload.speed=115200
chipkit_Pi.upload.tool=pic32prog

chipkit_Pi.bootloader.low_fuses=0xff
chipkit_Pi.bootloader.high_fuses=0xdd
chipkit_Pi.bootloader.extended_fuses=0x00
chipkit_Pi.bootloader.path=not-supported
chipkit_Pi.bootloader.file=not-supported
chipkit_Pi.bootloader.unlock_bits=0x3F
chipkit_Pi.bootloader.lock_bits=0x0F

chipkit_Pi.build.mcu=32MX250F128B
chipkit_Pi.build.f_cpu=40000000L
chipkit_Pi.build.core=pic32
chipkit_Pi.build.variant=ChipKIT_Pi

############################################################
############################################################
chipkit_Pi_USB_Serial.name=chipKIT Pi USB_Serial
chipkit_Pi_USB_Serial.group=chipKIT

# new items
chipkit_Pi_USB_Serial.platform=pic32
chipkit_Pi_USB_Serial.board=_BOARD_CHIPKIT_PI_
chipkit_Pi_USB_Serial.board.define=-D_USE_USB_FOR_SERIAL_
chipkit_Pi_USB_Serial.ccflags=-Map="map.map"
chipkit_Pi_USB_Serial.ldscript=chipKIT-application-32MX250F128.ld
# end of new items

# Use a high -Gnum for devices that have less than 64K of data memory
# For -G1024, objects 1024 bytes or smaller will be accessed by
# gp-relative addressing
chipkit_Pi_USB_Serial.compiler.c.flags=-O2 -c -mno-smart-io -w -ffunction-sections -fdata-sections -G1024 -g -mdebugger -Wcast-align -fno-short-double
chipkit_Pi_USB_Serial.compiler.cpp.flags=-O2 -c -mno-smart-io -w -fno-exceptions -ffunction-sections -fdata-sections -G1024 -g -mdebugger -Wcast-align -fno-short-double

