chipKIT32/chipKIT-core/pic32/boards.txt
chipkit_uc32.upload.protocol=stk500v2
chipkit_uc32.upload.maximum_size=520192
chipkit_uc32.upload.speed=115200
chipkit_uc32.upload.tool=pic32prog

chipkit_uc32.bootloader.low_fuses=0xff
chipkit_uc32.bootloader.high_fuses=0xdd
chipkit_uc32.bootloader.extended_fuses=0x00
chipkit_uc32.bootloader.path=not-supported
chipkit_uc32.bootloader.file=not-supported
chipkit_uc32.bootloader.unlock_bits=0x3F
chipkit_uc32.bootloader.lock_bits=0x0F

chipkit_uc32.build.mcu=32MX340F512H
chipkit_uc32.build.f_cpu=80000000L
chipkit_uc32.build.core=pic32
chipkit_uc32.build.variant=uC32

############################################################
############################################################
uc32_pmod.name=chipKIT uC32 with Pmod Shield
uc32_pmod.group=chipKIT

# new items
uc32_pmod.platform=pic32
uc32_pmod.board=_BOARD_UC32_
uc32_pmod.board.define=
uc32_pmod.ccflags=ffff
uc32_pmod.ldscript=chipKIT-application-32MX340F512.ld
# end of new items

# Use a high -Gnum for devices that have less than 64K of data memory
# For -G1024, objects 1024 bytes or smaller will be accessed by
# gp-relative addressing
uc32_pmod.compiler.c.flags=-O2 -c -mno-smart-io -w -ffunction-sections -fdata-sections -G1024 -g -mdebugger -Wcast-align -fno-short-double
uc32_pmod.compiler.cpp.flags=-O2 -c -mno-smart-io -w -fno-exceptions -ffunction-sections -fdata-sections -G1024 -g -mdebugger -Wcast-align -fno-short-double

uc32_pmod.upload.protocol=stk500v2
uc32_pmod.upload.maximum_size=520192
uc32_pmod.upload.speed=115200
uc32_pmod.upload.tool=pic32prog

uc32_pmod.bootloader.low_fuses=0xff
uc32_pmod.bootloader.high_fuses=0xdd
uc32_pmod.bootloader.extended_fuses=0x00
uc32_pmod.bootloader.path=not-supported
uc32_pmod.bootloader.file=not-supported
uc32_pmod.bootloader.unlock_bits=0x3F
uc32_pmod.bootloader.lock_bits=0x0F

uc32_pmod.build.mcu=32MX340F512H
uc32_pmod.build.f_cpu=80000000L
uc32_pmod.build.core=pic32
uc32_pmod.build.variant=uC32_Pmod_Shield

############################################################
############################################################
uno_pic32.name=chipKIT UNO32

# new items
uno_pic32.group=chipKIT
uno_pic32.platform=pic32
uno_pic32.board=_BOARD_UNO_
uno_pic32.board.define=
#uno_pic32.compiler.define=
uno_pic32.ccflags=ffff
uno_pic32.ldscript=chipKIT-application-32MX320F128.ld
# end of new items

# Use a high -Gnum for devices that have less than 64K of data memory
# For -G1024, objects 1024 bytes or smaller will be accessed by
# gp-relative addressing
uno_pic32.compiler.c.flags=-O2 -c -mno-smart-io -w -ffunction-sections -fdata-sections -G1024 -g -mdebugger -Wcast-align -fno-short-double
uno_pic32.compiler.cpp.flags=-O2 -c -mno-smart-io -w -fno-exceptions -ffunction-sections -fdata-sections -G1024 -g -mdebugger -Wcast-align -fno-short-double

uno_pic32.upload.tool=pic32prog
uno_pic32.upload.protocol=stk500v2
uno_pic32.upload.maximum_size=126976
uno_pic32.upload.speed=115200
uno_pic32.upload.tool=pic32prog


uno_pic32.bootloader.low_fuses=0xff
uno_pic32.bootloader.high_fuses=0xdd
uno_pic32.bootloader.extended_fuses=0x00
uno_pic32.bootloader.path=not-supported
uno_pic32.bootloader.file=not-supported
uno_pic32.bootloader.unlock_bits=0x3F
uno_pic32.bootloader.lock_bits=0x0F

uno_pic32.build.mcu=32MX320F128H
uno_pic32.build.f_cpu=80000000L
uno_pic32.build.core=pic32
uno_pic32.build.variant=Uno32

############################################################
############################################################
uno_pmod.name=chipKIT UNO32 with Pmod Shield
uno_pmod.group=chipKIT

# new items
uno_pmod.platform=pic32
uno_pmod.board=_BOARD_UNO_
uno_pmod.board.define=
#uno_pmod.compiler.define=
uno_pmod.ccflags=ffff
uno_pmod.ldscript=chipKIT-application-32MX320F128.ld
# end of new items

# Use a high -Gnum for devices that have less than 64K of data memory
# For -G1024, objects 1024 bytes or smaller will be accessed by
# gp-relative addressing
uno_pmod.compiler.c.flags=-O2 -c -mno-smart-io -w -ffunction-sections -fdata-sections -G1024 -g -mdebugger -Wcast-align -fno-short-double
uno_pmod.compiler.cpp.flags=-O2 -c -mno-smart-io -w -fno-exceptions -ffunction-sections -fdata-sections -G1024 -g -mdebugger -Wcast-align -fno-short-double

uno_pic32.upload.tool=pic32prog
uno_pmod.upload.protocol=stk500v2
uno_pmod.upload.maximum_size=126976
uno_pmod.upload.speed=115200
uno_pmod.upload.tool=pic32prog

uno_pmod.bootloader.low_fuses=0xff
uno_pmod.bootloader.high_fuses=0xdd
uno_pmod.bootloader.extended_fuses=0x00
uno_pmod.bootloader.path=not-supported
uno_pmod.bootloader.file=not-supported
uno_pmod.bootloader.unlock_bits=0x3F
uno_pmod.bootloader.lock_bits=0x0F

uno_pmod.build.mcu=32MX320F128H
uno_pmod.build.f_cpu=80000000L
uno_pmod.build.core=pic32
uno_pmod.build.variant=Uno32_Pmod_shield

############################################################
############################################################
chipkit_WF32.name=chipKIT WF32
chipkit_WF32.group=chipKIT


# new items
chipkit_WF32.platform=pic32
chipkit_WF32.board=_BOARD_WF32_
chipkit_WF32.board.define=
chipkit_WF32.ccflags=ffff
chipkit_WF32.ldscript=chipKIT-application-32MX695F512.ld
# end of new items

chipkit_WF32.upload.protocol=stk500v2
chipkit_WF32.upload.maximum_size=520192
chipkit_WF32.upload.speed=115200
chipkit_WF32.upload.tool=pic32prog

chipkit_WF32.bootloader.low_fuses=0xff
chipkit_WF32.bootloader.high_fuses=0xdd
chipkit_WF32.bootloader.extended_fuses=0x00
chipkit_WF32.bootloader.path=not-supported
chipkit_WF32.bootloader.file=not-supported
chipkit_WF32.bootloader.unlock_bits=0x3F
chipkit_WF32.bootloader.lock_bits=0x0F

chipkit_WF32.build.mcu=32MX695F512L
chipkit_WF32.build.f_cpu=80000000L
chipkit_WF32.build.core=pic32
chipkit_WF32.build.variant=WF32

############################################################
############################################################
chipkit_WiFire.name=chipKIT WiFire
chipkit_WiFire.group=chipKIT


# new items
chipkit_WiFire.platform=pic32
chipkit_WiFire.board=_BOARD_WIFIRE_
chipkit_WiFire.board.define=
chipkit_WiFire.ccflags=ffff
chipkit_WiFire.ldscript=MZ-application-32MZ2048ECX.ld
# end of new items

